#+TITLE: Simulación de múltiples modelos lineales
#+author: Marcos Bujosa
#+LANGUAGE: es

#+OPTIONS: toc:nil

#+EXCLUDE_TAGS: noexport

#+startup: shrink

#+LATEX_HEADER_EXTRA: \usepackage[spanish]{babel}
#+LATEX_HEADER_EXTRA: \usepackage{lmodern}
#+LATEX_HEADER_EXTRA: \usepackage{tabularx}
#+LATEX_HEADER_EXTRA: \usepackage{booktabs}

#+LATEX: \maketitle


* COMMENT basura

#+BEGIN_SRC sh  :exports none :results silent
rm -fr $(pwd)/IdentificaEstosARIMA 
mkdir -p $(pwd)/IdentificaEstosARIMA 
gretlcli -b $(pwd)/IdentificaEstosARIMA.inp
#+END_SRC


# set workdir /home/marcos/SynologyDrive/ReposGH/Docencia/POM-EconometriaAplicada-SRC/GretlScripts/IdentificaEstosARIMA
#+begin_src R :tangle IdentificaEstosARIMA.inp :exports none
# para que gretl guarde los ficheros en el directorio de la práctica
string directory = $(pwd) ~ "/IdentificaEstosARIMA"
set workdir "@directory" 
#+end_src


#+BEGIN_ABSTRACT
Los datos de este ejercicio son simulados.
#+END_ABSTRACT

#+BEGIN_SRC R :tangle IdentificaEstosARIMA.inp :exports none
#nulldata 480
setobs 12 1985:1 --time-series

open /home/marcos/SynologyDrive/ReposGH/Docencia/EconometriaAplicada-SRC/EjerciciosHide/SeriesSimuladas12/3fc69e.csv

#nulldata 160
setobs 4 1960:1 --time-series



foreign language=R --send-data #--quiet
  library(tfarima)      # librería de José Luis Gallego para Time Series
  #ma1p <- um(ma = "(1 - 0.9B)")
  ARIMA <- um(ma = "(1 - 0.8B12)", i = "(1 - B)")
  y = sim(ARIMA, n = 480)
  gretl.export(y)
  #library(xts)
  #dates <- seq(as.Date("1915-01-01"), 
  #             length = 400, 
  #             by = "months")
  #dat <- xts(x = y, order.by = dates)
  #write.zoo(dat, file="/home/marcos/gretl/dat.csv", sep=",", col.names=TRUE, index.name = "date",)
end foreign
append "/home/marcos/.gretl/y.csv" --time-series
#append "/home/marcos/gretl/dat.csv" --time-series

#gnuplot y --time-series --with-lines --output="SerieTemporal_y.png"
#corrgm y 38 --plot="ACF-PACF_serie_y.png"
store serie1.gdt y
delete y
#+END_SRC



#+BEGIN_SRC jupyter-python
import hashlib
my_string = '4201'
print(hashlib.shake_256(my_string.encode()).hexdigest(3))
print(hashlib.shake_128(my_string.encode()).hexdigest(3))

#+END_SRC

#+RESULTS:
: ec7f51
: 01201c


#+BEGIN_SRC jupyter-python
import hashlib
c=0
etiqueta = []
for ca,ma in enumerate(MA4):
    for cb,ar in enumerate(AR4):
        for cc,i in enumerate(I4):
            for l in range(2):
                modelo = "ARIMA <- um(ar = '%s', ma = '%s', i = '%s')\n"  %(ma,ar,i)
                caso = chr(ca*1000+cb*100+cc*10+l)
                c=c+1
                etiqueta = etiqueta + [(hashlib.shake_128(caso.encode()).hexdigest(3))]

print(c)
print(etiqueta)
#+END_SRC



#+BEGIN_SRC jupyter-python

lista = [MA4a,AR4,I4]
#a = itertools.combinations(l, 3) 
#y = [' '.join(i) for i in a]
combinations = list(itertools.combinations(lista, 3))

# Print the list of combinations to the console
print(len(combinations[0]))

for p in (combinations[0][2]):
    print(p)
#print(l)
#+END_SRC

#+RESULTS:
: 3
: 
: (1 - B)
: (1 - B4)
: (1 - B)(1 - B4)



#+BEGIN_SRC jupyter-python
import itertools

ar = [ '(1 - 0.8B)', '(1 + 0.8B)', '(1 - 0.8BS)', '(1 + 0.8BS)' ]
ma1 = [ '(1 - 0.7B)', '(1 + 0.7B)', '(1 - 0.7BS)']
ma2 = [ '(1 - 0.7B)', '(1 + 0.7B)', '(1 + 0.7BS)']

polinomio = ar
S = '4'

def polinomios(monimios, S):
    polinomios = []
    for i in range(len(monomios)+1):
        for c in itertools.combinations(monomios, i):
            if i < len(monomios):
                cc = ''.join(c).replace("S", S)
                polinomios = polinomios + [cc]
    return polinomios
                
AR = []; polinomio = ar; S='4'
for i in range(len(polinomio)+1):
    #print(i)
    for c in itertools.combinations(polinomio, i):
        if i < len(polinomio):
            cc = ''.join(c).replace("S", S)
            AR = AR + [cc]
            print(cc)
AR4 = AR
            
AR12 = []; polinomio = ar; S='12'
for i in range(len(polinomio)+1):
    #print(i)
    for c in itertools.combinations(polinomio, i):
        if i < len(polinomio):
            cc = ''.join(c).replace("S", S)
            AR4 = AR4 + [cc]
            print(cc)
print(AR4)
#+END_SRC

#+RESULTS:
#+begin_example
0

1
(1 - 0.8B)
(1 + 0.8B)
(1 - 0.8B4)
(1 + 0.8B4)
2
(1 - 0.8B)(1 + 0.8B)
(1 - 0.8B)(1 - 0.8B4)
(1 - 0.8B)(1 + 0.8B4)
(1 + 0.8B)(1 - 0.8B4)
(1 + 0.8B)(1 + 0.8B4)
(1 - 0.8B4)(1 + 0.8B4)
3
(1 - 0.8B)(1 + 0.8B)(1 - 0.8B4)
(1 - 0.8B)(1 + 0.8B)(1 + 0.8B4)
(1 - 0.8B)(1 - 0.8B4)(1 + 0.8B4)
(1 + 0.8B)(1 - 0.8B4)(1 + 0.8B4)
4
['', '(1 - 0.8B)', '(1 + 0.8B)', '(1 - 0.8B4)', '(1 + 0.8B4)', '(1 - 0.8B)(1 + 0.8B)', '(1 - 0.8B)(1 - 0.8B4)', '(1 - 0.8B)(1 + 0.8B4)', '(1 + 0.8B)(1 - 0.8B4)', '(1 + 0.8B)(1 + 0.8B4)', '(1 - 0.8B4)(1 + 0.8B4)', '(1 - 0.8B)(1 + 0.8B)(1 - 0.8B4)', '(1 - 0.8B)(1 + 0.8B)(1 + 0.8B4)', '(1 - 0.8B)(1 - 0.8B4)(1 + 0.8B4)', '(1 + 0.8B)(1 - 0.8B4)(1 + 0.8B4)']
#+end_example
